Revit 2027 API
AssemblyInstance.SetMemberIds Method
 Sets member element ids for the assembly instance. All existing members are cleared.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMemberIds(
	ICollection<ElementId> memberIds
)
Public Sub SetMemberIds (
	memberIds As ICollection(Of ElementId)
)
public:
void SetMemberIds(
	ICollection<ElementId^>^ memberIds
)
member SetMemberIds :
        memberIds : ICollection<ElementId> -> unit
Parameters
memberIds ICollection<ElementId>
 Element ids to set for the assembly instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ForbiddenForDynamicUpdateException |  This method may not be called during dynamic update.
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace